org/2021-34.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: 2021 年第 34 周总结
#+DATE: <2021-08-23 Mon>
8.16-8.22

每日习惯养成：

- Memrise 英语单词 3/7
  [[https://app.memrise.com/course/1370679/ying-yu-mei-shi-1/1/]]

本周主要任务：

- [[https://github.com/tianheg/blog/issues/137][Learning How to Learn]]
- [[https://github.com/tianheg/50projects50days]]
  一天完成一个(在完成的过程中，熟悉 HTML，CSS，JavaScript，阅读
  W3Schools，[[https://javascript.info]] ，MDN)
- [[https://github.com/tianheg/blog/issues/142][面试前端+个人技能]]

周一：

- [X] Learning How to Learn: Complete Week1
- [X] 50projects50days: day23

周二：

- [X] 阅读思考：SICP||命名和环境、组合式的求值、复合过程
- [X] 阅读思考：图解HTTP||1.2-1.4

周三：

- [X] 50projects50days: day24
- [X] [[https://github.com/tianheg/blog/issues/147][[SOLVED]arch linux
  system freeze after connecting wifi]] 从这一天开始

周四：

- [X] [[https://github.com/tianheg/blog/issues/147][[SOLVED]arch linux
  system freeze after connecting wifi]]

周五：

- [X] [[https://github.com/tianheg/blog/issues/147][[SOLVED]arch linux
  system freeze after connecting wifi]]
- [X] 重新写几篇博客：关于安装 Arch 系统、安装 Arch
  上使用软件(软件按照系统给出安装步骤)、如何日常使用 Arch

周六：

- [X] [[https://github.com/tianheg/blog/issues/147][[SOLVED]arch linux
  system freeze after connecting wifi]]

周日：

- [X] [[https://github.com/tianheg/blog/issues/147][[SOLVED]arch linux
  system freeze after connecting wifi]] 在这一天结束

思考：

- 番茄工作法，有限制25分钟内的工作内容吗？也就是说，它是否规定必须在25分钟内专注于同一件事？
- 制定成长计划：

  1. 长期的成长目标（半年/一年），明确达到长期目标所需要获得的技能点
  2. 阶段性（季度/月）分配时间，流动性分配任务，根据具体情况改变学习方法，理解技能内容
  3. 找到阻碍进步的事项，找到解决办法
  4. 复盘是重要的

- 想去英特尔工作
  [[https://jobs.intel.com/ShowJob/Id/3033930/Senior-Linux-kernel-engineer]]
