blog/2021/2021-34.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-06 Sun 20:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2021 年第 34 周总结</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">2021 年第 34 周总结</h1>
</header><p>
8.16-8.22
</p>

<p>
每日习惯养成：
</p>

<ul class="org-ul">
<li>Memrise 英语单词 3/7
<a href="https://app.memrise.com/course/1370679/ying-yu-mei-shi-1/1/">https://app.memrise.com/course/1370679/ying-yu-mei-shi-1/1/</a></li>
</ul>

<p>
本周主要任务：
</p>

<ul class="org-ul">
<li><a href="https://github.com/tianheg/blog/issues/137">Learning How to Learn</a></li>
<li><a href="https://github.com/tianheg/50projects50days">https://github.com/tianheg/50projects50days</a>
一天完成一个(在完成的过程中，熟悉 HTML，CSS，JavaScript，阅读
W3Schools，<a href="https://javascript.info">https://javascript.info</a> ，MDN)</li>
<li><a href="https://github.com/tianheg/blog/issues/142">面试前端+个人技能</a></li>
</ul>

<p>
周一：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Learning How to Learn: Complete Week1</li>
<li class="on"><code>[X]</code> 50projects50days: day23</li>
</ul>

<p>
周二：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 阅读思考：SICP||命名和环境、组合式的求值、复合过程</li>
<li class="on"><code>[X]</code> 阅读思考：图解 HTTP||1.2-1.4</li>
</ul>

<p>
周三：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 50projects50days: day24</li>
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/147">[SOLVED]arch linux
system freeze after connecting wifi</a> 从这一天开始</li>
</ul>

<p>
周四：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/147">[SOLVED]arch linux
system freeze after connecting wifi</a></li>
</ul>

<p>
周五：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/147">[SOLVED]arch linux
system freeze after connecting wifi</a></li>
<li class="on"><code>[X]</code> 重新写几篇博客：关于安装 Arch 系统、安装 Arch
上使用软件(软件按照系统给出安装步骤)、如何日常使用 Arch</li>
</ul>

<p>
周六：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/147">[SOLVED]arch linux
system freeze after connecting wifi</a></li>
</ul>

<p>
周日：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/147">[SOLVED]arch linux
system freeze after connecting wifi</a> 在这一天结束</li>
</ul>

<p>
思考：
</p>

<ul class="org-ul">
<li>番茄工作法，有限制 25 分钟内的工作内容吗？也就是说，它是否规定必须在 25 分钟内专注于同一件事？</li>
<li>制定成长计划：

<ol class="org-ol">
<li>长期的成长目标（半年/一年），明确达到长期目标所需要获得的技能点</li>
<li>阶段性（季度/月）分配时间，流动性分配任务，根据具体情况改变学习方法，理解技能内容</li>
<li>找到阻碍进步的事项，找到解决办法</li>
<li>复盘是重要的</li>
</ol></li>

<li>想去英特尔工作
<a href="https://jobs.intel.com/ShowJob/Id/3033930/Senior-Linux-kernel-engineer">https://jobs.intel.com/ShowJob/Id/3033930/Senior-Linux-kernel-engineer</a></li>
</ul>
</div>
</body>
</html>